Инвентаризация_IT/src/Documents/РасходованиеМатериалов/РасходованиеМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходованиеМатериалов</name>
  <registerRecords>AccumulationRegister.ОстаткиРасходныхМатериалов</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.РасходныеМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Инвентаризация_IT/src/AccumulationRegisters/ОстаткиРасходныхМатериалов/ОстаткиРасходныхМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиРасходныхМатериалов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасходныйМатериал</name>
    <type>
      <types>CatalogRef.РасходныеМатериалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Инвентаризация_IT/src/Documents/РасходованиеМатериалов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ОстаткиРасходныхМатериалов
	Движения.ОстаткиРасходныхМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы из Материалы Цикл
		Движение = Движения.ОстаткиРасходныхМатериалов.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Склад = Склад;
		Движение.РасходныйМатериал = ТекСтрокаМатериалы.Наименование;
		Движение.Количество = ТекСтрокаМатериалы.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
